package com.eden.lottery.event.scene;

import com.eden.lottery.constants.ResidenceConstants;
import com.eden.lottery.event.Event;
import com.eden.lottery.event.EventItem;

import java.util.List;

public final class CommonScenes {

    // 双人场景
    public static List<EventItem> LXD_QXH__01 = List.of(
            new EventItem("💕 厨房里，秦小淮正在忙碌着，她今天突发奇想，想做饭给李星斗吃 💕", "special"),
            new EventItem("💕 “哎呀烦死了，好麻烦！”秦小淮抱怨 💕", "special"),
            new EventItem("💕 “你也不帮我，就在那看！”秦小淮又抱怨 💕", "special"),
            new EventItem("💕 “黏黏的好恶心！”秦小淮又又抱怨 💕", "special"),
            new EventItem("💕 “要不还是让存子来做吧？”秦小淮试探地说 💕", "special"),
            new EventItem("💕 “做事要有始有终！”李星斗断然拒绝 💕", "special"),
            new EventItem("💕 “星斗爸爸，小骚猫的穴穴好湿……” 秦小淮开始耍赖 💕", "special"),
            new EventItem("💕 热腾腾的厨房里，秦小淮被插得胡言乱语起来： 💕", "special"),
            new EventItem("💕 “啊，星斗爸爸的大肉棒插得乖女儿好舒服……” 💕", "special")
    );

    public static List<EventItem> LXD_QXH__03 = List.of(
            new EventItem("💕 最近几天，秦小淮特别淫荡 💕", "special"),
            new EventItem("💕 “求求主人，来插小骚猫的小穴穴好不好……” 💕", "special"),
            new EventItem("💕 见李星斗不理她，她就用屁股上插的猫尾巴扫他眼睛 💕", "special"),
            new EventItem("💕 李星斗一下子就把她按倒了 💕", "special"),
            new EventItem("💕 “啊，喜欢星斗爸爸的大肉棒……” 💕", "special")
    );

    public static List<EventItem> LXD_QXH__04 = List.of(
            new EventItem("💕 深夜的浴室里，热气腾腾的水雾中 💕", "special"),
            new EventItem("💕 “星斗哥哥，我要洗背背～” 💕", "special"),
            new EventItem("💕 秦小淮娇滴滴地趴在浴缸边，水珠顺着雪白的肌肤滑落 💕", "special"),
            new EventItem("💕 下一秒她湿漉漉的花瓣就被入侵了 💕", "special")
    );

    public static List<EventItem> LXD_QXH__05 = List.of(
            new EventItem("💕 午后的阳光透过窗帘洒在床上 💕", "special"),
            new EventItem("💕 秦小淮穿着粉色的睡裙，慵懒地伸着懒腰 💕", "special"),
            new EventItem("💕 “星斗哥哥～小骚猫要抱抱……” 💕", "special"),
            new EventItem("💕 李星斗将她拥入怀中，顺势把手探入了她的内内里 💕", "special"),
            new EventItem("💕 “小淮宝宝还真容易湿呢。” 💕", "special")
    );

    public static List<EventItem> LXD_QXH__07 = List.of(
            new EventItem("💕 书房里，秦小淮趴在桌案上，屁股高高翘着 💕", "special"),
            new EventItem("💕 “星斗哥哥，小骚猫想要你的大肉棒了……” 💕", "special"),
            new EventItem("💕 李星斗掀起她的裙子，露出湿润粉嫩的花瓣 💕", "special"),
            new EventItem("💕 “你不是说要看一下午的书吗？这才十分钟” 💕", "special"),
            new EventItem("💕 秦小淮理直气壮：\"我就是这样的！” 💕", "special"),
            new EventItem("💕 书桌被撞得嘎吱作响，秦小淮软软地呻吟起来 💕", "special")
    );

    public static List<EventItem> LXD_QXH__08 = List.of(
            new EventItem("💕 雨夜里，秦小淮故意看恐怖电影 💕", "special"),
            new EventItem("💕 “星斗爸爸，小骚猫害怕，想要抱抱……” 💕", "special"),
            new EventItem("💕 李星斗把她按在沙发上：\"乖女儿又想要了？” 💕", "special"),
            new EventItem("💕 秦小淮嘻嘻一笑： 💕", "special"),
            new EventItem("💕 “您的乖女儿都流水了……” 💕", "special")
    );

    public static List<EventItem> LXD_QXH__09 = List.of(
            new EventItem("💕 花园里，李星斗正在浇花 💕", "special"),
            new EventItem("💕 “星斗哥哥来陪我玩好不好” 秦小淮撒娇说 💕", "special"),
            new EventItem("💕 李星斗不理她  💕", "special"),
            new EventItem("💕 “星斗哥哥，你的宝宝的小花园也湿了……” 💕", "special"),
            new EventItem("💕 李星斗板着脸：\"那我就给小乖宝的花园浇浇水” 💕", "special"),
            new EventItem("💕 秦小淮奸计得逞般嘻嘻一笑，突然啊了一声，就被李星斗插入了 💕", "special")
    );

    public static List<EventItem> LXD_QXH__10 = List.of(
            new EventItem("💕 阳台上，秦小淮穿着紧身衣在做瑜伽 💕", "special"),
            new EventItem("💕 “小乖宝的身体真柔软～” 李星斗从背后环抱住她 💕", "special"),
            new EventItem("💕 “干嘛～人家在认真锻炼呢！” 秦小淮娇嗔道 💕", "special"),
            new EventItem("💕 “那我也来帮你'锻炼'一下。” 李星斗一本正经地回答 💕", "special"),
            new EventItem("💕 “诶，你干嘛……” 秦小淮一下软了 💕", "special")
    );

    public static List<EventItem> LXD_QXH__11 = List.of(
            new EventItem("💕 深夜书桌前，秦小淮跪在桌子下面 💕", "special"),
            new EventItem("💕 李星斗假装没看见，继续研究着面前的文件 💕", "special"),
            new EventItem("💕 “啊……星斗哥哥好大，小骚猫的嘴都塞不下了” 秦小淮故意说 💕", "special"),
            new EventItem("💕 书桌下传来湿润的吮吸声 💕", "special")
    );

    // 李星斗，秦小淮，存子
    public static List<EventItem> LXD_QXH_CZ__01 = List.of(
            new EventItem("💕 天台上，黎明前的最后一刻 💕", "special"),
            new EventItem("💕 秦小淮和李星斗依偎着，存子缩在他们身后 💕", "special"),
            new EventItem("💕 突然，第一道阳光从远处射了出来，天空瞬间点亮大半 💕", "special"),
            new EventItem("💕 “好美的日出……” 存子感叹 💕", "special"),
            new EventItem("💕 “存子也站起来一起看吧”秦小淮想把存子拉到两人的中间 💕", "special"),
            new EventItem("💕 “不不不……小淮宝宝主人……”存子怯懦地后退着，身体却突然腾空而起 💕", "special"),
            new EventItem("💕 等她回过神来，发现自己已经骑在了李星斗的脖子上  💕", "special"),
            new EventItem("💕 “存子，你哆嗦什么？”李星斗说 ", "special"),
            new EventItem("💕 “呜……对不起……”存子拼命想忍住，高潮还是来了 💕", "special"),
            new EventItem("💕 “存子，你是不是尿在我脖子上了……”李星斗无奈地说 💕", "special")
    );
}